Testing/Load_Testing/atelier-load-test.yml
config:
  target: "http://127.0.0.1:3000"
  http:
    timeout: 20
  phases:
    - duration: 60
      arrivalRate: 5
      rampTo: 10
    - duration: 60
      arrivalRate: 10
      rampTo: 50
    - duration: 300
      rampTo: 50
scenarios:
  - name: All Atelier Get Routes
    flow:
      - get:
          url: "/reviews/?product_id=102&page=1&count=6&sort=newest"
      - get:
          url: "/reviews/meta?product_id=102"